# ============================================================
# Dotfiles - Brewfile
# Mac applications via Homebrew Cask
# Usage: brew bundle --file=Brewfile
# ============================================================

# ------- Base applications (always installed) -------
cask "airtable"
cask "antigravity"
cask "cursor"
cask "discord"
brew "docker"
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
cask "herd"
cask "hiddenbar"
cask "dbngin"
cask "macdown"
cask "openvpn-connect"
cask "phpstorm"
cask "spotify"
cask "tableplus"
cask "thunderbird"
cask "zoom"
cask "appcleaner"
brew "git-flow"
cask "font-geist-mono"

# ------- API Client (postman or insomnia, chosen in install.sh) -------
# Automatically added by install.sh
# cask "postman"
# cask "insomnia"

# ------- Optional applications (chosen in install.sh) -------
# cask "notion"
# cask "rectangle"
# cask "sequel-ace"
# cask "warp"
# cask "google-chrome@canary"
